# -*- coding:utf-8 -*-
"""
选择排序(Select sort）
"""

"""
算法描述：
每次让同一个下标的元素与其他元素依次做对比，然后根据规则交换位置
"""

li = [5, 4, 3, 2, 1]

'''
第一轮：用下标为0的元素与其他元素依次对比，最终最小的会在首位
[4, 5, 3, 2, 1]
[3, 5, 4, 2, 1]
[2, 5, 4, 3, 1]
[1, 5, 4, 3, 2]

第二轮：用下标为1的元素与其后边的元素依次对比
[1, 4, 5, 3, 2]
[1, 3, 5, 4, 2]
[1, 2, 5, 4, 3]

第三轮：
[1, 2, 4, 5, 3]
[1, 2, 3, 5, 4]

第四轮：
[1, 2, 3, 4, 5]
'''

n = len(li)

for i in range(n-1):
    for j in range(i+1, n):
        if li[i] > li[j]:
            li[i], li[j] = li[j], li[i]
    print(li)

print(li)
